import math
#2H2+CO==CH3OH(ж)
T = 298.15
R = 8.314462618

coef_CH3OH = [1.21754995E+01, -4.19673868E-02, 1.42400437E-04, -1.60999972E-07, 2.14794684E-10, -3.15401115E+04, -4.68827360E+01]
coef_H2 = [0.23443029E+01, 0.79804248E-02, -0.19477917E-04, 0.20156967E-07, -0.73760289E-11, -0.91792413E+03, 0.68300218E+00]
coef_CO = [0.35795335E+01, -0.61035369E-03, 0.10168143E-05, 0.90700586E-09, -0.90442449E-12, -0.14344086E+05, 0.35084093E+01]


def calc_H(coef, T):
    return R * T * (coef[0] + coef[1]*T/2 + coef[2]*pow(T,2)/3 + coef[3]*pow(T,3)/4 + coef[4]*pow(T,4)/5 + coef[5]/T)

H_CH3OH = calc_H(coef_CH3OH, T)
H_H2 = calc_H(coef_H2, T)
H_CO = calc_H(coef_CO, T)



delta_H = 6*H_H2 + H_CO - H_CH3OH

print(f"Тепловой эффект реакции:   {delta_H/1000:.2f} КДж/моль")
